app/controllers/pins_controller.rb

  def index
    #if current_user.nil?
      @pins = Pin.all #return to showing all pins for pinning
---
SELECT "pins".* FROM "pins"